levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
            ble_thingy_uis_led_set_constant(p_thingy_uis_c, 255, 255, 255);
            
            ble_gap_conn_params_t conn_params;
            conn_params.max_conn_interval = MAX_CONNECTION_INTERVAL;
            conn_params.min_conn_interval = MIN_CONNECTION_INTERVAL;
            conn_params.slave_latency     = SLAVE_LATENCY;
            conn_params.conn_sup_timeout  = SUPERVISION_TIMEOUT;

            sd_ble_gap_conn_param_update(p_thingy_uis_c_evt->conn_handle, &conn_params);
            
            scan_start(m_scan_mode_coded_phy);

        } break; // BLE_LBS_C_EVT_DISCOVERY_COMPLETE

        case BLE_LBS_C_EVT_BUTTON_NOTIFICATION:
        {
            // Forward the data to the app aggregator module
            //vinh change button -> send all sensor data
            app_aggregator_on_blinky_data(p_thingy_uis_c_evt->conn_handle, p_thingy_uis_c_evt->params.button.button_state);
            //vinh doing
            //vf_adv_thingy_data(0,AGG_NODE_LINK_DATA_UPDATE);  //broadcast data to sink


                //vinh doing
        
        } break; // BLE_LBS_C_EVT_BUTTON_NOTIFICATION

        default:
            // No implementation needed.
            break;
    }
}



/**@brief Function for handling the advertising report BLE event.
 *
 * @param[in] p_adv_report  Advertising report from the SoftDevice.
 */

//vinh temp
static char str_uart[128];
static uint16_t str_uart_len=0;



static void on_adv_report(ble_evt_t const * p_ble_evt)
{
    uint32_t      err_code;
    uint8_array_t adv_data;
    uint8_array_t dev_name;
    uint8_array_t service_uuid;
    //vinh
    uint8_array_t userdata;
    size_t i,trim_pos;
    //NRF_LOG_INFO("ADV");

    if (m_device_being_connected_info.dev_type == DEVTYPE_NONE)
    {

        // For readibility.
        ble_gap_evt_t  const * p_gap_evt  = &p_ble_evt->evt.gap_evt;
        ble_gap_addr_t const * peer_addr  = &p_gap_evt->params.adv_report.peer_addr;

        // Prepare advertisement report for parsing.
        adv_data.p_data = (uint8_t *)p_gap_evt->params.adv_report.data.p_data;
        adv_data.size   = p_gap_evt->params.adv_report.data.len;

        // Search for advertising names.
        bool found_name = false, found_blinky_name = false,found_clusterhead_data=false;
        err_code = adv_report_parse(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME,
                                    &adv_data,
                                    &dev_name);
        if (err_code != NRF_SUCCESS)
        {
            // Look for the short local name if it was not found as complete.
            err_code = adv_report_parse(BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME, &adv_data, &dev_name);
            if (err_code != NRF_SUCCESS)
            {
                // If we can't parse the data, then exit.
                //return;
            }
            else
            {
                found_name = true;
            }
        }
        else
        {
            found_name = true;
        }

        if (found_name)
        {
            //NRF_LOG_INFO("ADV name: %s", dev_name.p_data);
            // Check if the device name matches the BLINKY name filter
            if (strlen(m_target_periph_name) != 0)
            {
                if (memcmp(m_target_periph_name, dev_name.p_data, strlen(m_target_periph_name)) == 0)
                {
                    // Copy the name to a static variable, to pass it on to the smart phone later
                    if(dev_name.size > strlen(m_target_periph_name))
                    {
                        memcpy(m_device_name_being_connected_to, 
                               dev_name.p_data + strlen(m_target_periph_name), 
                               dev_name.size - strlen(m_target_periph_name));
                        m_device_name_being_connected_to[dev_name.size - strlen(m_target_periph_name)] = 0;
                    }
                    m_device_being_connected_info.dev_type = DEVTYPE_BLINKY;
                }
                else if(memcmp(m_target_blinky_name, dev_name.p_data, strlen(m_target_blinky_name)) == 0) //vinh, m_target_blinky_name -> THINGY
                {

                    found_blinky_name = true;
                    //vinh, not add Thingy to the list here since check RSSI at below code 
                }


                //else if(memcmp(m_target_clusterhead_name, dev_name.p_data, strlen(m_target_clusterhead_name)) == 0) //vinh, m_target_clusterhead_name -> CLUSTERHEAD
 
                /*--------------------------------
                //student: advertising receive--
                ------------------------*/
                else if(memcmp((const uint8_t *) DEVICE_NAME, dev_name.p_data, strlen((const uint8_t *) DEVICE_NAME)) == 0) //vinh, m_target_clusterhead_name -> CLUSTERHEAD
              {//found clusterhead name
                  found_clusterhead_data= true;

                  strcpy(str_uart,"find cluster head \n\r");
                  uart_printf(str_uart);//print to COM port

                  //parse user data
                  err_code = adv_report_parse(BLE_GAP_AD_TYPE_MANUFACTURER_SPECIFIC_DATA, &adv_data, &userdata);
                  if((err_code == NRF_SUCCESS)&&(p_gap_evt->params.adv_report.rssi >CLUSTERHEAD_RSSI_CONNECT_LIMIT))
                  {//have user data
                    strcpy(str_uart,"find userdata, \n\r");
                    uart_printf(str_uart);
                    uart_printf("$RSSI %d \n\r",p_gap_evt->params.adv_report.rssi);                    
                      
                    if(vf_check_source(&userdata)==true)
                    {//message return to source, do nothing
                       strcpy(str_uart,"reflect data userdata \n\r");
                       uart_printf(str_uart); //print to COM port
                    }

                    else
                    {//message from another source
                        if(vf_check_destination(&userdata)==true)
                        {//match destination -> process data
 
                            strcpy(str_uart,"process data \n\r");
                            uart_printf(str_uart);  //print to COM port
                             vf_process_adv_command(&userdata); 
                            i=0xFFFE;
                        }
                        else 
                        {//not destination ->validate packet(check redundant packet in buffer)
                            // ->relay data
                          //i=vf_validate_relay_packet(&userdata);
                          i=vf_validate_relay_packet2(&userdata); 
                        }
                      if((i==0xFFFF)||(i==0xFFFE))
                      {//new packet
                        if(i==0xFFFF){
                          //vf_modify_relay_data(&userdata); //increase TTL before relay
                          err_code=vf_add_packet_to_buffer2(&userdata); //add packet to buffer for advertising
                        }
                        //err_code=vf_add_packet_to_buffer(&userdata);

