levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
                      }//end new packet
                      else
                      {
                        uart_printf("Redundant packet\n\r");
                      }
                      
                    }//end message from another source

                    //relay_adv_data(); //broad cast buffer

                  }//end having user data
              }//end found cluster head
            }
            relay_adv_data2();  //broadcast next packet in buffer
            /*-----------------
            end clusterhead advertising recevier handler
            ---------------------*/

        
            // Look for Thingy UUID
            // Filter on RSSI to avoid connecting to everything in the room
            const uint8_t thingy_service_uuid[] = {0x42, 0x00, 0x74, 0xA9, 0xFF, 0x52, 0x10, 0x9B, 0x33, 0x49, 0x35, 0x9B, 0x00, 0x01, 0x68, 0xEF};
            //vinh change
            //if(p_gap_evt->params.adv_report.rssi > THINGY_RSSI_CONNECT_LIMIT || found_blinky_name)
            if(p_gap_evt->params.adv_report.rssi > THINGY_RSSI_CONNECT_LIMIT && found_blinky_name)
            {
                err_code = adv_report_parse(BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_MORE_AVAILABLE, &adv_data, &service_uuid);
                if (err_code == NRF_SUCCESS)
                {
                    if (memcmp(service_uuid.p_data, thingy_service_uuid, 16) == 0)
                    {
                        NRF_LOG_INFO(found_blinky_name ? "Named Thingy!!" : "Thingy!!");
                        if(found_name)
                        {
                            memcpy(m_device_name_being_connected_to, 
                                   dev_name.p_data, dev_name.size);
                            m_device_name_being_connected_to[dev_name.size] = 0;
                        }
                        m_device_being_connected_info.dev_type = DEVTYPE_THINGY;
                    }
                }
            }

        


            if ((m_device_being_connected_info.dev_type != DEVTYPE_NONE)&& (found_clusterhead_data==false))
            //vinh, add cluster head to check condition   
            {
                m_device_being_connected_info.phy = m_scan_params.scan_phys;
            
                // Initiate connection.
                err_code = sd_ble_gap_connect(peer_addr, &m_scan_params, &m_connection_param, APP_BLE_CONN_CFG_TAG);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_ERROR("Connection Request Failed, reason %d", err_code);
                }
            }
        }
    }
    if(m_device_being_connected_info.dev_type == DEVTYPE_NONE)
    {
        // As of SoftDevice version 6.0 scanning must be started manually after each received packet
        err_code = sd_ble_gap_scan_start(NULL, &m_scan_buffer);
        if(err_code == NRF_ERROR_INVALID_STATE)
        {
            NRF_LOG_ERROR("scan_start invalid state!!");
        }
        else APP_ERROR_CHECK(err_code);
    }
    else
    {
        scan_led_state_set(false, false);
    }
}

static uint8_t peer_addr_LR[NRF_SDH_BLE_CENTRAL_LINK_COUNT][6];

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */

 //vinh 0, important function
 //Duc, event when smartphone/cluster head
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;
    static uint8_t coded_phy_conn_count = 0;

    // For readability.
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;
    //NRF_LOG_INFO("Evt: %i", p_ble_evt->header.evt_id);
    switch (p_ble_evt->header.evt_id)
    {
        // Upon connection, check which peripheral has connected, initiate DB
        // discovery, update LEDs status and resume scanning if necessary.
        case BLE_GAP_EVT_CONNECTED:
        {
            // Handle central connections
            if(p_gap_evt->params.connected.role == BLE_GAP_ROLE_CENTRAL)
            {
                        NRF_LOG_INFO("Peer addr  %02x%02x%02x%02x%02x%02x",
                        peer_addr_LR[p_gap_evt->conn_handle][0],
                        peer_addr_LR[p_gap_evt->conn_handle][1],
                        peer_addr_LR[p_gap_evt->conn_handle][2],
                        peer_addr_LR[p_gap_evt->conn_handle][3],
                        peer_addr_LR[p_gap_evt->conn_handle][4],
                        peer_addr_LR[p_gap_evt->conn_handle][5]);

                NRF_LOG_INFO("Connection 0x%x established , starting DB discovery.",
                             p_gap_evt->conn_handle);

                memcpy(&peer_addr_LR[p_gap_evt->conn_handle][0], &p_gap_evt->params.connected.peer_addr.addr[0], 6);

                //APP_ERROR_CHECK_BOOL(p_gap_evt->conn_handle < NRF_SDH_BLE_CENTRAL_LINK_COUNT);

                switch(m_device_being_connected_info.dev_type)
                {
                    case DEVTYPE_BLINKY:
                        err_code = ble_lbs_c_handles_assign(&m_lbs_c[p_gap_evt->conn_handle],
                                                            p_gap_evt->conn_handle, NULL);
                        APP_ERROR_CHECK(err_code);
                        break;
                    
                    case DEVTYPE_THINGY:
                        
                        err_code = ble_thingy_uis_c_handles_assign(&m_thingy_uis_c[p_gap_evt->conn_handle],
                                                                   p_gap_evt->conn_handle, NULL);
                        //vinh ver2
                        if(g_is_sink==false)
                        {//advertise this new node to sink
                          vf_adv_thingy_data(p_gap_evt->conn_handle,AGG_NODE_LINK_CONNECTED);
                        //vf_adv_thingy_data(p_gap_evt,AGG_NODE_LINK_CONNECTED); //advertising to sink new thingy 
                        }

                        APP_ERROR_CHECK(err_code);
                        break;
                    
                    default:
                        break;
                }

                m_service_discovery_conn_handle = p_gap_evt->conn_handle;
                memset(&m_db_disc[p_gap_evt->conn_handle], 0x00, sizeof(ble_db_discovery_t));
                err_code = ble_db_discovery_start(&m_db_disc[p_gap_evt->conn_handle],
                                                  p_gap_evt->conn_handle);
                if (err_code != NRF_ERROR_BUSY)
                {
                    APP_ERROR_CHECK(err_code);
                }
                
                err_code = sd_ble_gap_rssi_start(p_gap_evt->conn_handle, 5, 4);
                APP_ERROR_CHECK(err_code);

                err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, p_gap_evt->conn_handle, APP_DEFAULT_TX_POWER);
                APP_ERROR_CHECK(err_code);

                // Notify the aggregator service
                app_aggregator_on_central_connect(p_gap_evt, &m_device_being_connected_info);
                
                // Update LEDs status, and check if we should be looking for more
                if (ble_conn_state_central_conn_count() == NRF_SDH_BLE_CENTRAL_LINK_COUNT)
                {
                    bsp_board_led_off(CENTRAL_SCANNING_LED);
                }
                else
                {
                    // Resume scanning.
                    //bsp_board_led_on(CENTRAL_SCANNING_LED);
                    //scan_start();
                }
                
