levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
                m_device_being_connected_info.dev_type = DEVTYPE_NONE;

                // check if it was a coded phy connection
                if(BLE_GAP_PHY_CODED == m_scan_params.scan_phys)
                {
                    coded_phy_conn_count++;
                    m_coded_phy_conn_handle[p_gap_evt->conn_handle] = p_gap_evt->conn_handle;
                    bsp_board_led_on(CODED_PHY_LED);
                }
            }
            // Handle links as a peripheral here
            else
            {// Duc commented "connected to phone"
                //vinh doing
                g_is_sink=true;

                m_per_con_handle = p_gap_evt->conn_handle;
                NRF_LOG_INFO("Peripheral connection 0x%x established.", m_per_con_handle);    
                //vinh, start timer  to update all thingy connection to smartphone
                app_timer_start(m_post_message_delay_timer_id, APP_TIMER_TICKS(2000), 0);
                
                app_timer_stop(m_adv_led_blink_timer_id);
                
                bsp_board_led_on(PERIPHERAL_ADV_CON_LED);
            }
        } break; // BLE_GAP_EVT_CONNECTED

        // Upon disconnection, reset the connection handle of the peer which disconnected, update
        // the LEDs status and start scanning again.
        case BLE_GAP_EVT_DISCONNECTED:
        {
                NRF_LOG_INFO("Peer addr  %02x%02x%02x%02x%02x%02x",
                        peer_addr_LR[p_gap_evt->conn_handle][0],
                        peer_addr_LR[p_gap_evt->conn_handle][1],
                        peer_addr_LR[p_gap_evt->conn_handle][2],
                        peer_addr_LR[p_gap_evt->conn_handle][3],
                        peer_addr_LR[p_gap_evt->conn_handle][4],
                        peer_addr_LR[p_gap_evt->conn_handle][5]);

            NRF_LOG_INFO("GAP_EVT_DISCONNECT: %i", p_gap_evt->conn_handle);

            // Handle central disconnections
            if(p_gap_evt->conn_handle != m_per_con_handle)
            {//thingy disconnected
                NRF_LOG_INFO("LBS central link 0x%x disconnected (reason: 0x%x)",
                             p_gap_evt->conn_handle,
                             p_gap_evt->params.disconnected.reason);

                if(p_gap_evt->conn_handle == m_service_discovery_conn_handle)
                {
                    m_service_discovery_conn_handle = BLE_CONN_HANDLE_INVALID;
                }
                
                // Notify aggregator service
                app_aggregator_on_central_disconnect(p_gap_evt);

                if(m_coded_phy_conn_handle[p_gap_evt->conn_handle] != BLE_CONN_HANDLE_INVALID)
                {
                    // This is a coded phy link that got disconnected
                    m_coded_phy_conn_handle[p_gap_evt->conn_handle] = BLE_CONN_HANDLE_INVALID;
                    if(--coded_phy_conn_count == 0)
                    {
                        bsp_board_led_off(CODED_PHY_LED);
                    }
                }

                //vinh
                if(g_is_sink==false)
                {//advertise this new node to sink
                  vf_adv_thingy_data(p_gap_evt->conn_handle,AGG_NODE_LINK_DISCONNECTED);
                //vf_adv_thingy_data(p_gap_evt,AGG_NODE_LINK_CONNECTED); //advertising to sink new thingy 
                }
                
                // Start scanning, in case the disconnect happened during service discovery
                scan_start(m_scan_mode_coded_phy);
            }
            // Handle peripheral disconnect
            else
            {// Duc commented phone disconnected

                //vinh
                g_is_sink=false;


                NRF_LOG_INFO("Peripheral connection disconnected (reason: 0x%x)", p_gap_evt->params.disconnected.reason);
                m_per_con_handle = BLE_CONN_HANDLE_INVALID;
                
                app_aggregator_clear_buffer();
                app_timer_stop(m_post_message_delay_timer_id);
                
                bsp_board_led_off(PERIPHERAL_ADV_CON_LED);
         
                    
                // Start advertising
                advertising_start();
            }
        } break;

        case BLE_GAP_EVT_ADV_REPORT:
            on_adv_report(p_ble_evt);
            break;

        case BLE_GAP_EVT_TIMEOUT:
        {
            if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
            {
                // This can only happen with central (initiator request timeout)
                NRF_LOG_INFO("Connection request timed out.");

                scan_start(m_scan_mode_coded_phy);
            }
            else if(p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN)
            {
                // On scan timeout, restart scanning in the opposite mode (1M vs coded)
                scan_start(!m_scan_mode_coded_phy);
            }
        } break;
        
        case BLE_GAP_EVT_ADV_SET_TERMINATED:
            NRF_LOG_INFO("Advertise timeout - Restarting...");

            // Start advertising
            advertising_start();
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST.");
            // Accept parameters requested by peer.
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                        &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GAP_EVT_PHY_UPDATE:
        {
            ble_gap_evt_phy_update_t phy_update = p_ble_evt->evt.gap_evt.params.phy_update;
            if(phy_update.status == BLE_HCI_STATUS_CODE_SUCCESS)
            {
                NRF_LOG_INFO("PHY updated: %i, %i", phy_update.tx_phy, phy_update.rx_phy);
                app_aggregator_phy_update(p_ble_evt->evt.gap_evt.conn_handle, phy_update.tx_phy, phy_update.rx_phy);
            }
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
        {
          //vinh
            g_is_sink=false;

            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTS_EVT_TIMEOUT:
        {
                //vinh
                g_is_sink=false;

            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
        } break;
        
        case BLE_GAP_EVT_RSSI_CHANGED:
            app_aggregator_rssi_changed(p_ble_evt->evt.gap_evt.conn_handle, p_ble_evt->evt.gap_evt.params.rssi_changed.rssi);
            break;
            
        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{//vinh stop
    uint32_t       err_code;
    ble_agg_cfg_service_init_t agg_cfg_service_init;

    memset(&agg_cfg_service_init, 0, sizeof(agg_cfg_service_init));

    agg_cfg_service_init.data_handler = agg_cfg_service_data_handler;

