levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
    uint8_t advlen=org_adv_data_size;
    static uint8_t relay_data[32];
     uint16_t pos=g_userdata_firstpos;
    uint8_t relay_size;

    while(g_userdata.size>0) //check nubmer of used block
    {
          pos=g_userdata_currpos;
          if(g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]==0)
          {//size of data =0 ->delete block
            vf_delete_block_buffer();
          }
          else if(g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4+4]>=4) //max TTL=4
          {//TTL expired ->delete block
            vf_delete_block_buffer();
          }
          else
          {
            if(g_userdata_currpos==g_userdata_lastpos) //reach lastpos -> first pos 
                g_userdata_currpos=g_userdata_firstpos;
            else
              g_userdata_currpos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];

            relay_size= g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4];
            g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4+4]++; //increase TTL

            relay_data[0]=relay_size;
            relay_data[1]=0xff; //type: MANUFACTURER  
            memcpy(&relay_data[2],&g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],relay_size);
            memcpy(&adv_packet.adv_data.p_data[advlen],relay_data,relay_size+1);
            adv_packet.adv_data.len=org_adv_data_size+relay_size+1;

             uart_printf("adv relay data *%d (len)%d @%d",j,adv_packet.adv_data.len,pos );
              j++;
             for(int i=0;i<adv_packet.adv_data.len;i++)
              {
                uart_printf("%d  ",adv_packet.adv_data.p_data[i] );
              }
              uart_printf("\n\r"); 
            break;
          }

    }//while
   
}


//advertising to sink new thingy 
 /*void vf_adv_thingy_connected(ble_evt_t *p_gap_evt) 
{
//vinh doing
ble_thingy_uis_c_evt_t * p_thingy



  uint8_t data_arr[32],str1[20],i;
  uint8_array_t idata;
//vinh doing
  idata.p_data=data_arr;
  idata.p_data[0]=CLUSTER_ID; //cluster source id
  idata.p_data[1]=10; //cluster destination id
  idata.p_data[2]=g_packetID++; //packet No
  idata.p_data[3]=0; //hop counts  
  idata.p_data[4]=AGG_NODE_LINK_DATA_UPDATE; //link state 
  idata.p_data[5]=p_thingy->conn_handle; //local id
  idata.p_data[6]=12;//temp1
  idata.p_data[7]=12;//temp1
  idata.p_data[8]=34;//pressure1
  idata.p_data[9]=56;//pressure2         
  idata.p_data[10]=00;//hummi 1
  idata.p_data[11]=78;//hummi 2
  idata.size=12;

  uart_printf(" Relay Received thingy data: ");
  for(i=0;i<12;i++)
  {
    sprintf(str1,"%d ",idata.p_data[i]);
    uart_printf(str1);
  }
  uart_printf("\r\n");
  vf_add_packet_to_buffer2(&idata);
  relay_adv_data2();

}*/
/*
@brief: modify relay data by increasing TTL, byte[3] of input
*/
static void vf_modify_relay_data(uint8_array_t *checkdata)
{
  checkdata->p_data[3]++;
}

/*
@brief: validate relay data, looking up in the buffer to find an element match with new data:
1. source addr (byte 0), destination addr(byte 1), packet id(byte2) 
2. if (1.) match, check time to live (byte 3) and update the new to old if the new is higher
 
3.  if (1.) not match, return 0xFFFF -> new packet
*/
static uint16_t vf_validate_relay_packet(uint8_array_t *checkdata)
{

  uint8_t src_id=0;
  uint8_array_t userdata;
  uint8_t cmpdata[4];
  uint8_t i,size;
  size_t temp_pos=g_userdata_firstpos;
  size_t pos=g_userdata_firstpos;
  while(pos!=g_userdata_lastpos)
  {
      temp_pos=pos+1;
      for(i=0;i<4;i++)
      {
        if(temp_pos>=MAX_USERDATA_BUFFER)
        {
          temp_pos=0;
        }
        cmpdata[i]=garr_userdata[temp_pos++];
      }
      if(memcmp(checkdata->p_data,cmpdata,3)==0)
      {//matched
        if(checkdata->p_data[3]>cmpdata[3])
        {//update TTL if new is higher than old
          garr_userdata[temp_pos-1]=checkdata->p_data[3];
        }

        return pos;
      }
      else
      {//unmatched, check next packet in buffer

        size=g_userdata.p_data[pos];
        if(size+pos<=MAX_USERDATA_BUFFER)
        {
          pos+=size;
        }
        else
        {
          pos=0+size-(MAX_USERDATA_BUFFER-pos);
        }
      }
  }
  return 0xFFFF;
}


/*
@brief: validate relay data, looking up in the buffer to find an element match with new data:
1. source addr (byte 0), destination addr(byte 1), packet id(byte2) 
2. if (1.) match, check time to live (byte 3) and update the new to old if the new is higher
 return the position of match item
3.  if (1.) not match, return 0xFFFF -> new packet
*/
static uint16_t vf_validate_relay_packet2(uint8_array_t *checkdata)
{

  uint8_t src_id=0;
  uint8_array_t userdata;
  uint8_t cmpdata[4];
  uint8_t i,size;
  size_t temp_pos=g_userdata_firstpos;
  size_t pos=g_userdata_firstpos;

  if(g_userdata.size==0)
    return 0xFFFF;
  else if(g_userdata.size==1)
  {
      temp_pos=pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5;    
      for(i=0;i<4;i++)
      {
        cmpdata[i]=g_userdata.p_data[temp_pos++];
      }
      if(memcmp(checkdata->p_data,cmpdata,3)==0)
      {
     /*check TTL
        if(checkdata->p_data[3]>cmpdata[3])
        {//update TTL if new is higher than old
          g_userdata.p_data[temp_pos-1]=checkdata->p_data[3];
        }*/

        return pos;
      }
      else
      {
        return 0xFFFF;
      }

  }
  else
  {
    while(pos!=g_userdata_lastpos)
   {
      temp_pos=pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5;    
      for(i=0;i<4;i++)
      {
        cmpdata[i]=g_userdata.p_data[temp_pos++];
      }
      if(memcmp(checkdata->p_data,cmpdata,3)==0)
      {
      /*check TTL
        if(checkdata->p_data[3]>cmpdata[3])
        {//update TTL if new is higher than old
          g_userdata.p_data[temp_pos-1]=checkdata->p_data[3];
        }*/

        return pos;
      }
      else
      {//unmatched, check next packet in buffer
        pos=g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+1];
      }
    }
  }
  return 0xFFFF;
}

/*--------------------
@brief: modify input data to preparing send back to the source
*/
void vf_process_adv_command(uint8_array_t *data)
{//send to phone
  //if(g_is_sink==true) vinh doing


//vinh doing
    vf_app_adv_data_send_to_phone(data);

