levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
uint8_t vf_add_packet_to_buffer2(uint8_array_t *data)
{
//each block include 32 bytes
//byte 0: block property: 0x0: free, 0xFF: used
//byte 1: pointer to next available block,0xFF is NULL
//byte 2: pointer to previous available block,0xFF is NULL
//byte 4..n:size + data
//g_userdata_lastpos: position of last block in buffer
//g_userdata_firstpos: position of last block in buffer
  uint8_array_t *userdata=data;
  uint8_t err_code=1;
  size_t pos,i;
  if((g_userdata.size)<MAX_USERDATA_BUFFER_BLOCK)
  {//buffer not overflow

      for(i=0;i<MAX_USERDATA_BUFFER_BLOCK;i++)
      {
        if(g_userdata.p_data[i*MAX_USERDATA_BUFFER_BLOCKSIZE]==0) //found free block
        {
          err_code=0;
          break;
        }
      }
      
      if(err_code==0)
      {  
      //found free block
        pos=i;
        if( g_userdata.size==0)
        {
          g_userdata.p_data[pos*32+1]=g_userdata.p_data[pos*32+2]=0xFF; 
          g_userdata_currpos=g_userdata_lastpos=g_userdata_firstpos=pos;
        }
        else
        {
          g_userdata.p_data[g_userdata_lastpos*32+1]=pos; //update previous "next block pointer"
          g_userdata.p_data[pos*32+2]=g_userdata_lastpos; //update current "pre block pointer"
          g_userdata_lastpos=pos; //update last position
        }
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE]=0xFF;  //mark as used block
        g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+4]=userdata->size+1; //number of data byte in this block, include this byte
        memcpy(&g_userdata.p_data[pos*MAX_USERDATA_BUFFER_BLOCKSIZE+5],userdata->p_data,userdata->size);
        g_userdata.size++; 
      }
  

  }//end buffer not full

  if (err_code==0)
  {
       uart_printf("@%d $%d $%d *",g_userdata.size,g_userdata_lastpos,userdata->size); 
       for(i=0;i<userdata->size+1+4;i++)
       {
          uart_printf("%d ", g_userdata.p_data[g_userdata_lastpos*MAX_USERDATA_BUFFER_BLOCKSIZE+i]);
       }
      uart_printf("\n\r");
  }
  else
  {
    uart_printf("Buffer full");
  }
  return err_code;
}


/**@brief Function for setting up advertising data. */
static void advertising_data_set(void)
{
    ret_code_t err_code;

    
    adv_data.name_type          = BLE_ADVDATA_FULL_NAME;
    adv_data.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    adv_data.include_appearance = false;


    sr_data.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    sr_data.uuids_complete.p_uuids = m_adv_uuids;
 
 
    adv_packet.adv_data.p_data = &adv_data_buf[0];
    adv_packet.adv_data.len = ADV_MAX_LENGTH;
    adv_packet.scan_rsp_data.p_data = sr_data_buf;
    adv_packet.scan_rsp_data.len = ADV_MAX_LENGTH;

    


    err_code = ble_advdata_encode(&adv_data, adv_packet.adv_data.p_data, &adv_packet.adv_data.len);
    APP_ERROR_CHECK(err_code);
    
    err_code = ble_advdata_encode(&sr_data, adv_packet.scan_rsp_data.p_data, &adv_packet.scan_rsp_data.len);
    APP_ERROR_CHECK(err_code);

   //vinh
    org_adv_data_size=adv_packet.adv_data.len;
    uart_printf("%d  ",adv_packet.adv_data.len );
    

    //student: initial advertising data
    org_adv_data_size=adv_packet.adv_data.len;  //mark the start position of datafield 

    adv_packet.adv_data.p_data[org_adv_data_size+0]=19; //length
    adv_packet.adv_data.p_data[org_adv_data_size+1]=0xff; //type
    adv_packet.adv_data.p_data[org_adv_data_size+2]=CLUSTER_ID; //source
    adv_packet.adv_data.p_data[org_adv_data_size+3]=SINK_ID; //destination
    adv_packet.adv_data.p_data[org_adv_data_size+4]=0x3; //Packet_no
    adv_packet.adv_data.p_data[org_adv_data_size+5]=0x0; //TTL
    adv_packet.adv_data.p_data[org_adv_data_size+6]=0x1; //data 1
    adv_packet.adv_data.p_data[org_adv_data_size+7]=0x1; //data 2
    adv_packet.adv_data.p_data[org_adv_data_size+8]=0x1; //data 3
    adv_packet.adv_data.p_data[org_adv_data_size+9]=0x1; //data 4
    adv_packet.adv_data.p_data[org_adv_data_size+10]=0x1; //data 5
    adv_packet.adv_data.p_data[org_adv_data_size+11]=0x1; //data 6
    adv_packet.adv_data.p_data[org_adv_data_size+12]=0x1; //data 7
    adv_packet.adv_data.p_data[org_adv_data_size+13]=0x1; //data 8
    adv_packet.adv_data.p_data[org_adv_data_size+14]=0x1; //data 9
    adv_packet.adv_data.p_data[org_adv_data_size+15]=0x1; //data 10
    adv_packet.adv_data.p_data[org_adv_data_size+16]=0x1; //data 11
    adv_packet.adv_data.p_data[org_adv_data_size+17]=0x1; //data 12
    adv_packet.adv_data.p_data[org_adv_data_size+18]=0x1; //data 13
    adv_packet.adv_data.p_data[org_adv_data_size+19]=0x1; //data 14

    memset(&adv_packet.adv_data.p_data[org_adv_data_size],0,20);
    adv_packet.adv_data.len=org_adv_data_size+20; //length

    
    //adv_params.properties.connectable = 1;
    //adv_params.properties.scannable = 1;
    //adv_params.properties.legacy_pdu = 1;
    // Duc GAP settings for advertising here
    adv_params.properties.type = BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
    adv_params.p_peer_addr   = NULL;
    adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
    adv_params.interval      = PERIPHERAL_ADV_INTERVAL;
    adv_params.duration      = PERIPHERAL_ADV_TIMEOUT_IN_SECONDS * 100;
    adv_params.primary_phy   = BLE_GAP_PHY_1MBPS;
    adv_params.secondary_phy = BLE_GAP_PHY_1MBPS;

    memcpy((void*)&adv_params2,(void*)&adv_params,sizeof(adv_params));

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &adv_packet, &adv_params);
    APP_ERROR_CHECK(err_code);
 
}


/**@brief Function for starting advertising. */
static void advertising_start(void)
{
    NRF_LOG_INFO("Starting advertising.");
    
    ret_code_t err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
    
    err_code = app_timer_start(m_adv_led_blink_timer_id, APP_TIMER_TICKS(500), 0);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for writing to the LED characteristic of all connected clients.
 *
 * @details Based on if the button is pressed or released, this function writes a high or low
 *          LED status to the server.
 *
 * @param[in] button_action The button action (press/release).
 *            Determines if the LEDs of the servers will be ON or OFF.
 *
 * @return If successful NRF_SUCCESS is returned. Otherwise, the error code from @ref ble_lbs_led_status_send.
 */
static ret_code_t led_status_send_to_all(uint8_t button_action)
{
    ret_code_t err_code;

    for (uint32_t i = 0; i< NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
    {
        err_code = ble_lbs_led_status_send(&m_lbs_c[i], button_action);

        if(err_code != NRF_SUCCESS)
        {
            err_code = ble_thingy_uis_led_set_on_off(&m_thingy_uis_c[i], button_action);
            //err_code = ble_thingy_uis_led_set_constant(&m_thingy_uis_c[i], button_action ? 255 : 0, button_action ? 255 : 0, button_action ? 255 : 0);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE)
            {
                return err_code;
            }
        }
    }
    return NRF_SUCCESS;
}
 
 
static ret_code_t led_status_send_by_mask(uint8_t button_action, uint8_t r, uint8_t g, uint8_t b, uint32_t mask)
{
    ret_code_t err_code;
    uint8_t colors[3] = {r, g, b};
    
    app_aggregator_on_led_color_set(r, g, b, mask);

