levietduc/CPS_WSAN/nrf52Tutorial/ble_aggregator/main.c
    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_per_con_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/** @brief Function to sleep until a BLE event is received by the application.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details Handle any pending log operation(s), then sleep until the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/** @brief Function for initializing the log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();    
}


void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}


static void uart_init()
{
    uint32_t err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER,
        TX_PIN_NUMBER,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        HWFC,
        false,
        UART_BAUDRATE_BAUDRATE_Baud460800
    };

    APP_UART_FIFO_INIT(&comm_params,
                       16,
                       1024,
                       uart_error_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);

    APP_ERROR_CHECK(err_code);
}

void post_message_connect_callback(void *p)
{
    app_aggregator_update_link_status();
}

/** @brief Function for initializing the timer.
 */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_adv_led_blink_timer_id, APP_TIMER_MODE_REPEATED, adv_led_blink_callback);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_scan_led_blink_timer_id, APP_TIMER_MODE_REPEATED, scan_led_blink_callback);
    APP_ERROR_CHECK(err_code);
    
    err_code = app_timer_create(&m_post_message_delay_timer_id, APP_TIMER_MODE_SINGLE_SHOT, post_message_connect_callback);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
    
    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, 64);
    APP_ERROR_CHECK(err_code);
}


static void process_app_commands()
{//process command from phone           
    if(agg_cmd_received != 0)
    {          
        uint32_t mask;
        NRF_LOG_INFO("APP COMMAND %d",agg_cmd_received);
        switch(agg_cmd_received)
        {
            case APPCMD_SET_LED_ALL: //change LED colors of all
                for(int i = 2; i >= 0; i--)
                {
                    mask = mask << 8 | agg_cmd[4 + i];
                }
                led_status_send_by_mask(agg_cmd[0], agg_cmd[1], agg_cmd[2], agg_cmd[3], mask);
                break;
                
            case APPCMD_SET_LED_ON_OFF_ALL: //on/of LED
                for(int i = 2; i >= 0; i--)
                {
                    mask = mask << 8 | agg_cmd[1 + i];
                }
                led_status_on_off_send_by_mask(agg_cmd[0], mask);
                break;
                
            case APPCMD_POST_CONNECT_MESSAGE:
                post_connect_message(agg_cmd[0]);
                break;
            
            case APPCMD_DISCONNECT_PERIPHERALS:
                disconnect_all_peripherals();
                break;

            case APPCMD_DISCONNECT_CENTRAL://disconnect to phone event
                sd_ble_gap_disconnect(m_per_con_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                break;
            
            default:
                break;
        }
        agg_cmd_received = 0;
    }
}





int main(void)
{
    uint32_t err_code;

    //vinh
    //name clusterhead and string to detect blinky group
    char str1[4],s;
    sprintf(str1,"%d",CLUSTER_ID);
 
    strcat(m_target_clusterhead_name,(const char*)str1);
    /*s='A'+CLUSTER_ID-1;
    m_target_blinky_name[0]=m_target_blinky_name[1]=s;
    m_target_blinky_name[2]=0;*/
    g_userdata_currpos=g_userdata_lastpos=g_userdata_firstpos;
    g_userdata.size=0;  
    memset(garr_userdata,0,sizeof(garr_userdata));

    log_init();
    timer_init();
    uart_init();
    leds_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    app_aggregator_init(&m_agg_cfg_service);
    db_discovery_init();
    lbs_c_init();
    thingy_uis_c_init();
    ble_conn_state_init();
    advertising_data_set();
    conn_params_init();
    
    enable_gpio_debug();

    NRF_LOG_INFO("Multilink example started");
    //uart_printf("Multilink example started. Group name \"%s\"\r\n", m_target_periph_name); //vinh, change group name
    uart_printf("Multilink example started. Device Name \"%s\"\r\n", m_target_clusterhead_name); //vinh, change group name
    uart_printf("Multilink example started. Thingy Group \"%s\"\r\n", m_target_blinky_name); //vinh, change group name

    

    for (int i = 0; i < NRF_SDH_BLE_TOTAL_LINK_COUNT; ++i){
        m_coded_phy_conn_handle[i] = BLE_CONN_HANDLE_INVALID; //vinh, init the handle
    }
    // Start scanning for peripherals and initiate connection to devices which  advertise.
    scan_start(false);

    // Start advertising
    advertising_start();
    
    err_code = app_button_enable();
    APP_ERROR_CHECK(err_code);
    
    for (;;)
    {
        if(m_per_con_handle != BLE_CONN_HANDLE_INVALID) //vinh BLE is ongoing
        {
            while(app_aggregator_flush_ble_commands()); //flush all command in buffer
        }

        process_app_commands();

        device_list_print();
        
        while(NRF_LOG_PROCESS());

        power_manage();
    }
}


